#### OpenTofu Validation 🤖`success`
  <details><summary>Validation Output</summary>

  ```

  Success! The configuration is valid.

  ```

  </details>

  #### OpenTofu Plan 📖`success`

  <details><summary>Show Plan</summary>

  ```

  module.data.module.onepassword.data.onepassword_vault.swag_lgbt: Reading...
module.data.module.onepassword.data.onepassword_vault.swag_lgbt: Read complete after 0s [id=vaults/syp4svuf7qzbcuu5umljoo4bb4]
module.data.module.onepassword.data.onepassword_item.cloudflare_api_token: Reading...
module.data.module.onepassword.data.onepassword_item.digitalocean_access_token: Reading...
module.data.module.onepassword.data.onepassword_item.onepassword_service_account_token: Reading...
module.data.module.onepassword.data.onepassword_item.cloudflare_api_token: Read complete after 1s [id=vaults/syp4svuf7qzbcuu5umljoo4bb4/items/olodum4evqjyj2znrkx62tuwve]
module.data.module.onepassword.data.onepassword_item.digitalocean_access_token: Read complete after 1s [id=vaults/syp4svuf7qzbcuu5umljoo4bb4/items/v5un5i5yzxapu2r3j5t6llivqu]
module.data.module.onepassword.data.onepassword_item.onepassword_service_account_token: Read complete after 1s [id=vaults/syp4svuf7qzbcuu5umljoo4bb4/items/oj6efv7u5w6so5a35icnca7lae]
module.apps.module.passport.data.onepassword_item.stytch_api_subdomain: Reading...
module.data.module.cloudflare.data.cloudflare_zone.swag_lgbt: Reading...
module.data.module.cloudflare.data.cloudflare_zone.swag_lgbt: Read complete after 1s [id=243f037e4db09925df6e0c04681b4971]
module.apps.module.passport.data.onepassword_item.stytch_api_subdomain: Read complete after 1s [id=vaults/syp4svuf7qzbcuu5umljoo4bb4/items/txtiult7ny4zu2vpm76t43okjq]

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

OpenTofu will perform the following actions:

  # module.apps.module.passport.cloudflare_pages_domain.passport will be created
  + resource "cloudflare_pages_domain" "passport" {
      + account_id   = "8046ced7e2c70129d1732280998af108"
      + domain       = "account.swag.lgbt"
      + id           = (known after apply)
      + project_name = "swag-lgbt-passport"
      + status       = (known after apply)
    }

  # module.apps.module.passport.cloudflare_pages_project.passport will be created
  + resource "cloudflare_pages_project" "passport" {
      + account_id        = "8046ced7e2c70129d1732280998af108"
      + created_on        = (known after apply)
      + domains           = (known after apply)
      + id                = (known after apply)
      + name              = "swag-lgbt-passport"
      + production_branch = "main"
      + subdomain         = (known after apply)

      + build_config {
          + build_caching   = true
          + build_command   = "pnpm pages:build"
          + destination_dir = ".vercel/output/static"
          + root_dir        = "apps/passport"
        }

      + source {
          + type = "github"

          + config {
              + deployments_enabled           = true
              + owner                         = "swagLGBT"
              + pr_comments_enabled           = true
              + preview_branch_excludes       = (known after apply)
              + preview_branch_includes       = (known after apply)
              + preview_deployment_setting    = "all"
              + production_branch             = "main"
              + production_deployment_enabled = true
              + repo_name                     = "swagLGBT"
            }
        }
    }

  # module.apps.module.passport.cloudflare_record.passport will be created
  + resource "cloudflare_record" "passport" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "account"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = 1
      + type            = "CNAME"
      + value           = (known after apply)
      + zone_id         = "243f037e4db09925df6e0c04681b4971"
    }

  # module.apps.module.passport.cloudflare_record.stytch will be created
  + resource "cloudflare_record" "stytch" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "api.stytch"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = 3600
      + type            = "CNAME"
      + value           = "wax-shirt-5140.customers.stytch.com"
      + zone_id         = "243f037e4db09925df6e0c04681b4971"
    }

Plan: 4 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to:
/home/runner/work/swagLGBT/swagLGBT/tofu-plan-erm-9209410918

To perform exactly these actions, run the following command to apply:
    tofu apply "/home/runner/work/swagLGBT/swagLGBT/tofu-plan-erm-9209410918"

  ```

  </details>